---
type: SingleServerService
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 4
tags: [revit-api, class]
---

# SingleServerService

`Autodesk.Revit.DB.ExternalService.SingleServerService` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetActiveServerId | — | `` |
| Method | GetActiveServerId | 2013 | `public Guid GetActiveServerId ()` |
| Method | SetActiveServer | — | `` |
| Method | UnsetActiveServer | 2013 | `public void UnsetActiveServer ( Document document )` |